#include <iostream>

int main ()
{

    // Масив с размер 16 от указатели от тип int.
    int *za[16];

    // Масив с размер 16 от констатни указателя от тип int.
    int * const a[16];

    // Масив с размер 4 от масив с размер 64 от тип const int.
    const int b[4][64];

    // Указател от масив с 24 проментливи от тип const int.
    const int (*c)[24];

    // Указател от масив с 8 променливи от масив с 16 променливи от тип int.
    int (*d)[8][16];

    // Екстремалните случаи:
    
    // Указател от константен указател от масив с 24 проментливи от тип int.
    int (* const * e)[24];

    // Указател от масив с 8 променливи от указател от масив с 32 променливи от тип int.
    int (*((*f)[8]))[32];

    return 0;
}
